# Pandas - DataFrame Part 2

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

### 4. 데이터 조작

- 탐색

In [2]:
df = sns.load_dataset('titanic')
df.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [3]:
df.tail(3)

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[3 rows x 15 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [5]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [6]:
ans = sns.load_dataset('anscombe')
ans.head(3)

  dataset     x     y
0       I  10.0  8.04
1       I   8.0  6.95
2       I  13.0  7.58

In [7]:
ans.tail(3)

   dataset    x     y
41      IV  8.0  5.56
42      IV  8.0  7.91
43      IV  8.0  6.89

In [8]:
ans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   dataset  44 non-null     object
 1   x        44 non-null     float64
 2   y        44 non-null     float64
dtypes: float64(2), object(1)
memory usage: 1.2+ KB

In [9]:
ans.describe()

               x          y
count  44.000000  44.000000
mean    9.000000   7.500682
std     3.198837   1.958925
min     4.000000   3.100000
25%     7.000000   6.117500
50%     8.000000   7.520000
75%    11.000000   8.747500
max    19.000000  12.740000

In [10]:
ans.groupby('dataset').describe()

            x                           ...     y
        count mean       std  min  25%  ...   min    25%   50%   75%    max
dataset                                 ...
I        11.0  9.0  3.316625  4.0  6.5  ...  4.26  6.315  7.58  8.57  10.84
II       11.0  9.0  3.316625  4.0  6.5  ...  3.10  6.695  8.14  8.95   9.26
III      11.0  9.0  3.316625  4.0  6.5  ...  5.39  6.250  7.11  7.98  12.74
IV       11.0  9.0  3.316625  8.0  8.0  ...  5.25  6.170  7.04  8.19  12.50

[4 rows x 16 columns]

- sum, mean : axis=0 가 디폴트

In [11]:
np.random.seed(2021)
df = pd.DataFrame(np.random.randint(10, size=(4,8)))
df

   0  1  2  3  4  5  6  7
0  4  5  9  0  6  5  8  6
1  6  6  6  1  5  7  1  1
2  5  2  0  3  1  0  2  6
3  4  8  5  1  6  7  5  6

In [12]:
df.sum()

0    19
1    21
2    20
3     5
4    18
5    19
6    16
7    19
dtype: int64

In [13]:
df.sum(axis=1)

0    43
1    33
2    19
3    42
dtype: int64

In [14]:
df['sum'] = df.sum(axis=1)
df

   0  1  2  3  4  5  6  7  sum
0  4  5  9  0  6  5  8  6   43
1  6  6  6  1  5  7  1  1   33
2  5  2  0  3  1  0  2  6   19
3  4  8  5  1  6  7  5  6   42

In [15]:
df.mean(axis=1)

0    9.555556
1    7.333333
2    4.222222
3    9.333333
dtype: float64

In [16]:
df.iloc[:, :-1].mean(axis=1)

0    5.375
1    4.125
2    2.375
3    5.250
dtype: float64

In [17]:
df['avg'] = df.iloc[:, :-1].mean(axis=1).round(2)
df

   0  1  2  3  4  5  6  7  sum   avg
0  4  5  9  0  6  5  8  6   43  5.38
1  6  6  6  1  5  7  1  1   33  4.12
2  5  2  0  3  1  0  2  6   19  2.38
3  4  8  5  1  6  7  5  6   42  5.25

- 결측치 처리

In [18]:
df = sns.load_dataset('titanic')
df.tail(3)

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[3 rows x 15 columns]

In [19]:
# 결측치 유무 여부 확인: df.info()
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [20]:
# embarked 를 최빈값으로 대체
df.embarked.value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [21]:
df.embarked.fillna('S')
df.embarked.isna().sum()

2

In [22]:
df.embarked.fillna('S', inplace=True)
df.embarked.isna().sum()

0

In [24]:
# age를 평균으로 대체
df.age.fillna(df.age.mean(), inplace=True)
df.age.isnull().sum()

0

In [25]:
df.tail(3)

     survived  pclass     sex        age  ...  deck  embark_town  alive  alone
888         0       3  female  29.699118  ...   NaN  Southampton     no  False
889         1       1    male  26.000000  ...     C    Cherbourg    yes   True
890         0       3    male  32.000000  ...   NaN   Queenstown     no   True

[3 rows x 15 columns]

In [26]:
# deck 컬럼은 버림
df.drop(columns=['deck'], inplace=True)
df.tail(3)

     survived  pclass     sex        age  ...  adult_male  embark_town  alive  alone
888         0       3  female  29.699118  ...       False  Southampton     no  False
889         1       1    male  26.000000  ...        True    Cherbourg    yes   True
890         0       3    male  32.000000  ...        True   Queenstown     no   True

[3 rows x 14 columns]

In [27]:
# embark_town 결측치가 있는 행을 지움
df.dropna(subset=['embark_town'], inplace=True)
df.isna().sum().sum()

0